from retriever import *


raw_texts = [
    "این یک تست به زبان فارسی است.",
        "مراقبت با وابستگی یا حمایت افراطی کاملا ناسازگار است.",
    "امید متفاوت است با آرزومندی و خیالپردازی",
    "به گفته میراف شجاعت دست در دست امید پیش میروند",
    "با از میان رفتن آشفتگیها، زندگی پیچیدگی کمتری پیدا میکند",
    "این به معنای کمال نیست، اما میتواند ما را در مسیر کمال قرار دهد",
    """"برای درک بهتر این موضوع به مثالی از شرایطی که در آنها فرآیند زندگی را ناکافی احساس میکنیم دقت
کنید. زمانی که از نیروهای خاص خود استفاده نم یکنیم حس میکنیم زندگی راضی کننده نیست. مثلا
وقتی نویسندهای از نوشتن منع میشود یا پرستاری از تیمارداری، در چینین زمانهایی خود را موثر
احساس نمیکنیم و به نظر میرسد که بیرون زندگی ایستادهایم""",
"""او می‌گوید انسان در طول تاریخ، از زمانی که شکارچی-گردآورنده بوده تا اکنون که تمدن مدرنی بنا کرده، سازگاری فوق‌العاده‌ای با شرایط گوناگون داشته است و به همین دلیل به آینده انسان و هوش مصنوعی امیدوار است. بااین‌حال، او اذعان می‌کند که انقلاب صنعتی نیز برای همه مسیری هموار نبود. هاسابیس می‌گوید: «ما باید تلاش کنیم تا اختلال [ناشی از هوش مصنوعی] را به حداقل برسانیم.»   آینده هوش مصنوعی از نگاه مدیرعامل گوگل دیپ‌مایند از دیدگاه هاسابیس، آینده پس از دستیابی به هوش جامع مصنوعی (AGI)، در صورت مدیریت صحیح، یک آرمان‌شهر خواهد بود؛ دنیایی از «فراوانی رادیکال» که در آن، پیشرفت‌های پزشکی، دستیابی به انرژی همجوشی و سفرهای بین‌ستاره‌ای ممکن می‌شود. اما او مسائل بزرگ پیش رو را نیز نادیده نمی‌گیرد.  هاسابیس معتقد است که دستاوردهای هوش مصنوعی درحل بحران اقلیمی، بسیار بیشتر از هزینه‌های انرژی آن خواهد بود. همچنین به عقیده او جامعه باید برای دنیایی که در آن «دیگر نیازی به کارکردن نیست»، فکری اساسی داشته باشد و مفاهیمی مانند «هدف» و «معنا» را بازتعریف کند.""",
"""ررسی تأثیر اعتیاد به اینستاگرام و تیک‌تاک بر تصمیم‌گیری‌های مالی محققان به‌طور خاص بررسی کرده‌اند که آیا افرادی که علائم بیشتری از اعتیاد به ویدیوهای کوتاه دارند، دچار کاهش «زیان‌گریزی» نیز هستند یا خیر. زیان‌گریزی گرایشی روان‌شناختی است که به تمایل افراد برای جلوگیری و اجتناب از ضرر و زیان در مقابل سود اشاره دارد. این مفهوم به‌طور کلی به افراد کمک می‌کند از رفتارهای پرخطر پرهیز کنند.  تحقیقات قبلی نشان داده‌اند که افراد مبتلا به اختلال قمار، وابستگی به الکل و برخی اعتیادهای مواد مخدر، زیان‌گریزی کمتری دارند، اما اطلاعات کمی در مورد بروز این الگو در اعتیادهای رفتاری غیرمرتبط با مواد مخدر، مانند استفاده وسواسی از ویدیوهای کوتاه، وجود داشته است.  برای بررسی این موضوع، پژوهشگران 36 دانشجو 18 تا 24 ساله را انتخاب کردند. همه آنها پرسشنامه‌ای استاندارد درباره علائم اعتیاد به ویدیوهای کوتاه را تکمیل کردند که شامل سؤالاتی درباره دفعات تجربه نیاز شدید به مصرف محتوا، دشواری در کنترل استفاده و پیامدهای منفی ناشی از تماشای بیش از حد ویدیو بود.""",
"""اما برخلاف انتظار، داستان تایتانیک ۲ به نقشه‌ی راه ساخت یک کشتی عظیم، مدرن یا نوستالژیک شباهتی ندارد و بیشتر چرخه‌ای بی‌پایان از وعده‌های بزرگ، سکوت‌های طولانی و راه‌اندازی‌های مجدد را روایت می‌کند.  این پروژه که در سال ۲۰۱۲ با هیاهوی رسانه‌ای گسترده‌ای آغاز شد، قرار بود ادای احترامی باشکوه به کشتی اصلی باشد، اما در عمل به یک مطالعه‌ی موردی جذاب در مورد بلندپروازی‌های یک فرد، پیچیدگی‌های مهندسی مدرن و قدرت روابط‌عمومی تبدیل شد.  آیا تایتانیک ۲ سرانجام در دریا شناور می‌شود تا سفری را که خواهر بزرگ‌ترش هرگز به پایان نرساند، کامل کند؟ یا برای همیشه یک «کشتی رؤیایی» باقی خواهد ماند که تنها روی کاغذ و در کنفرانس‌های خبری پر زرق‌وبرق جان می‌گیرد؟ برای یافتن پاسخ، باید به دل داستانی پیچیده سفر کنیم."""
]

query = "تن آشفتگیها، زندگی پیچیدگی کمتری"
query = " یا حمایت افراطی کاملا ناسازگار"
query = "معنای کمال نیست، اما میتواند"
query = " a framework for developing"
query = "نگاه مدیرعامل گوگل دیپ‌مایند از دیدگاه هاسابیس، آینده پس از دستیابی به ه"

@timer
def rerun():
    ret = Retriever(new_vdb=False)
    rets = ret.load_vdb(query=query)
    ret.display(retrieved_docs=rets)
rerun()

@timer
def run():
    ret = Retriever(new_vdb=True)
    ret.make_vdb(raw_text = raw_texts, chunk_size=64, chunk_overlap=4)
    ret = Retriever(new_vdb=False)
    rets = ret.load_vdb(query=query)
    ret.display(retrieved_docs=rets)
# run()