from retrieve import *
from generate import *
from dotenv import load_dotenv
load_dotenv()


raw_texts = [
    "این یک تست به زبان فارسی است.",
        "مراقبت با وابستگی یا حمایت افراطی کاملا ناسازگار است.",
    "امید متفاوت است با آرزومندی و خیالپردازی",
    "به گفته میراف شجاعت دست در دست امید پیش میروند",
    "با از میان رفتن آشفتگیها، زندگی پیچیدگی کمتری پیدا میکند",
    "این به معنای کمال نیست، اما میتواند ما را در مسیر کمال قرار دهد",
    """"برای درک بهتر این موضوع به مثالی از شرایطی که در آنها فرآیند زندگی را ناکافی احساس میکنیم دقت
کنید. زمانی که از نیروهای خاص خود استفاده نم یکنیم حس میکنیم زندگی راضی کننده نیست. مثلا
وقتی نویسندهای از نوشتن منع میشود یا پرستاری از تیمارداری، در چینین زمانهایی خود را موثر
احساس نمیکنیم و به نظر میرسد که بیرون زندگی ایستادهایم""",
"""او می‌گوید انسان در طول تاریخ، از زمانی که شکارچی-گردآورنده بوده تا اکنون که تمدن مدرنی بنا کرده، سازگاری فوق‌العاده‌ای با شرایط گوناگون داشته است و به همین دلیل به آینده انسان و هوش مصنوعی امیدوار است. بااین‌حال، او اذعان می‌کند که انقلاب صنعتی نیز برای همه مسیری هموار نبود. هاسابیس می‌گوید: «ما باید تلاش کنیم تا اختلال [ناشی از هوش مصنوعی] را به حداقل برسانیم.»   آینده هوش مصنوعی از نگاه مدیرعامل گوگل دیپ‌مایند از دیدگاه هاسابیس، آینده پس از دستیابی به هوش جامع مصنوعی (AGI)، در صورت مدیریت صحیح، یک آرمان‌شهر خواهد بود؛ دنیایی از «فراوانی رادیکال» که در آن، پیشرفت‌های پزشکی، دستیابی به انرژی همجوشی و سفرهای بین‌ستاره‌ای ممکن می‌شود. اما او مسائل بزرگ پیش رو را نیز نادیده نمی‌گیرد.  هاسابیس معتقد است که دستاوردهای هوش مصنوعی درحل بحران اقلیمی، بسیار بیشتر از هزینه‌های انرژی آن خواهد بود. همچنین به عقیده او جامعه باید برای دنیایی که در آن «دیگر نیازی به کارکردن نیست»، فکری اساسی داشته باشد و مفاهیمی مانند «هدف» و «معنا» را بازتعریف کند.""",
"""ررسی تأثیر اعتیاد به اینستاگرام و تیک‌تاک بر تصمیم‌گیری‌های مالی محققان به‌طور خاص بررسی کرده‌اند که آیا افرادی که علائم بیشتری از اعتیاد به ویدیوهای کوتاه دارند، دچار کاهش «زیان‌گریزی» نیز هستند یا خیر. زیان‌گریزی گرایشی روان‌شناختی است که به تمایل افراد برای جلوگیری و اجتناب از ضرر و زیان در مقابل سود اشاره دارد. این مفهوم به‌طور کلی به افراد کمک می‌کند از رفتارهای پرخطر پرهیز کنند.  تحقیقات قبلی نشان داده‌اند که افراد مبتلا به اختلال قمار، وابستگی به الکل و برخی اعتیادهای مواد مخدر، زیان‌گریزی کمتری دارند، اما اطلاعات کمی در مورد بروز این الگو در اعتیادهای رفتاری غیرمرتبط با مواد مخدر، مانند استفاده وسواسی از ویدیوهای کوتاه، وجود داشته است.  برای بررسی این موضوع، پژوهشگران 36 دانشجو 18 تا 24 ساله را انتخاب کردند. همه آنها پرسشنامه‌ای استاندارد درباره علائم اعتیاد به ویدیوهای کوتاه را تکمیل کردند که شامل سؤالاتی درباره دفعات تجربه نیاز شدید به مصرف محتوا، دشواری در کنترل استفاده و پیامدهای منفی ناشی از تماشای بیش از حد ویدیو بود.""",
"""اما برخلاف انتظار، داستان تایتانیک ۲ به نقشه‌ی راه ساخت یک کشتی عظیم، مدرن یا نوستالژیک شباهتی ندارد و بیشتر چرخه‌ای بی‌پایان از وعده‌های بزرگ، سکوت‌های طولانی و راه‌اندازی‌های مجدد را روایت می‌کند.  این پروژه که در سال ۲۰۱۲ با هیاهوی رسانه‌ای گسترده‌ای آغاز شد، قرار بود ادای احترامی باشکوه به کشتی اصلی باشد، اما در عمل به یک مطالعه‌ی موردی جذاب در مورد بلندپروازی‌های یک فرد، پیچیدگی‌های مهندسی مدرن و قدرت روابط‌عمومی تبدیل شد.  آیا تایتانیک ۲ سرانجام در دریا شناور می‌شود تا سفری را که خواهر بزرگ‌ترش هرگز به پایان نرساند، کامل کند؟ یا برای همیشه یک «کشتی رؤیایی» باقی خواهد ماند که تنها روی کاغذ و در کنفرانس‌های خبری پر زرق‌وبرق جان می‌گیرد؟ برای یافتن پاسخ، باید به دل داستانی پیچیده سفر کنیم.""",
"""ور خورشید نمی‌تواند به اعماق اقیانوس برسد، بنابراین حیات در کف اقیانوس و اطراف آن نمی‌تواند بر پایه فتوسنتز باشد. پژوهشگران مدت‌هاست فرض کرده‌اند که گودال‌های هادال میزبان جوامعی هستند که انرژی خود را از واکنش‌های شیمیایی دیگری به دست می‌آورند. گمان می‌رود این واکنش به گازهایی مانند سولفید هیدروژن و متان که از کف اقیانوس خارج می‌شوند، وابسته باشند. اما محققان می‌گویند چنین جوامعی که مبتنی بر کموسنتز هستند، به‌ندرت مستند شده‌اند.""",
"""ماهی مرکب غول‌پیکر علاوه‌بر اندازه عظیم، ویژگی‌های منحصربه‌فرد دیگری نیز دارد؛ قلاب‌هایی چرخان روی 2 شاخک اصلی آن که می‌توانند تا 360 درجه بچرخند و شکار را محکم نگه دارند. همچنین این گونه بزرگ‌ترین چشم در میان تمام جانوران زنده و منقرض‌شده را دارد؛ ویژگی‌ که احتمالاً برای دید در تاریکی مطلق اعماق اقیانوس تکامل یافته است.""",
"""ان ال پی (NLP) چیست ؟ به راستی (NLP) چیست ؟قبل از هر چیز باید بگویم که NLP مخفف چه کلماتى ست. Neuro-Linguistic Programming (برنامه ریزی عصبى- کلامى) معناى ابتدایى این هست که هرکسی به­ واسطه قدرت کلام می‌تواند بر سیستم عصبی‌ تأثیر بگذارد و ذهن خود یا دیگرى را برنامه‌ریزی کند! این علم، در کشورهاى اتحادیه اروپا و ایالات‌ متحده بسیار شناخته‌ شده ا­ست. حتی در فرم استخدامِ برخى سازمان‌ها هم میزانِ آشنایی باNLP مورد پرسش قرار می گیرد.  ابتدا مروری داشته باشیم بر تاریخچه‌ای از NLP  خب، داستان شکل‌گیری ان ال پى و دوره ان ال پی (NLP) از دهه ی هفتاد میلادی آغاز می گردد. روزی، دو نفر به نام­ های ریچارد بندلر و جان گریندر به‌طور اتفاقى در ساعتِ آزاد دانشگاه باهم آشنا و مشغولِ صحبت می شوند. این صحبتها، آنها را متوجه یک هدف مشترک می کند!  هدف مشترک شان را در قالب سؤال ایجاد می کنند:  موفقیت در زندگی آیا موفقیت در زندگى شانسى است؟ یا قاعده و فرمول دارد؟ آنها باور داشتند که اگر موفقیت در زندگی، شانسی باشد خب قطعاً هیچ کسی هیچ نقشی در تعیینِ آن نخواهد داشت! اما اگر قرار باشد قاعده و قانونی برای موفقیت در نظر گرفت می­ بایست آن را کشف کنند و در اختیار همه ی مردم بگذارند. ریچارد و جان، همچنان در حال مطالعه و تحقیق بودند تا اینکه تصمیم گرفتند رمزِ موفقیتِ موفق‌ترین آدم‌هایی که در دسترس شان بود را بپرسند! آنها این راه را، به عنوان سریع ترین راهکار ارائه دادند. برای همین، لیستی بلندبالا از اسامیِ چهره ­های موفق تهیه کردند. با مصاحبه و گفتگوهای طولانی که با این اشخاص صورت گرفت حجم گسترده ای از اطلاعاتِ پراکنده بدست آمد. ریچارد و جان همچنان با تلاش­ های خستگی ناپذیرشان ادامه می دادند تا اینکه این زحماتشان منجر به آشنایی با سه انسانِ نابغه شد!  ۱- خانم ویرجینیا ساتیر ۲- آقاى فریتز پرلز ۳- دکتر میلتون اریکسون  نتیجه تحقیقاتشان روى این سه نفر NLP را پدید آورد.""",
"""به گزارش گروه استان‌ها خبرگزاری دانشجو، طبق اعلام استانداری‌های برخی استان‌های سراسر کشور فردا (چهارشنبه ۱۵ مرداد) فعالیت ادارات، مدارس و دانشگاه‌ها تعطیل است و در برخی استان‌ها نیز فعالیت ادارات به صورت دورکاری صورت می‌گیرد.  لیست زیر به صورت تجمیعی از استان‌هایی تهیه شده است که فردا چهارشنبه ۱۵ مرداد تعطیل هستند:  تهران  اصفهان  قزوین  خراسان رضوی  خراسان جنوبی  گیلان  هرمزگان  کهگیلویه و بویراحمد  چهارمحال و بختیاری  فارس (فعالیت به صورت دورکاری)  ایلام (فعالیت به صورت دورکاری)  قم  آذربایجان شرقی  یزد  گلستان  خوزستان (فعالیت به صورت دورکاری)  سمنان  کرمان  خراسان جنوبی  بوشهر  البرز  کرمانشاه  کردستان  مرکزی""",
]


logging.basicConfig(level=logging.DEBUG)


@timer
def run(query):
    retriever = Retriever(new_vdb=True)
    retriever.create_vdb(raw_texts = raw_texts, chunk_size=64, chunk_overlap=4)
    rets = retriever.load_vdb(query=query, k=2)
    docs = retriever.extract_docs(retrieved_docs=rets)
    return docs


API_KEY=os.getenv('API_KEY')
BASE_URL = os.getenv('BASE_URL')
MODEL_NAME = os.getenv('MODEL_NAME')


if __name__ == "__main__":
    user_query = input('Enter your question:')
    pre_prompt = "You are a RAG system, some question will be asked by the user, you need to answer based on only the retreived docs\
    and only the question asked and not any irrelevant retrieved docs"
    print(call_llm(model_name=MODEL_NAME,
                   api_key=API_KEY,
                   base_url=BASE_URL,
                   prompt = pre_prompt + '\n' + f'here is the user question: {user_query}' + '\n' + 'here is the retrieved docs:' + run(user_query)))